mdbsliguo/stm32_template_SPL/Drivers/dma/dma.c
/**
 * @file dma.c
 * @brief DMA驱动模块实现
 * @version 1.0.0
 * @date 2024-01-01
 * @details 基于STM32标准外设库的DMA驱动，支持DMA1/2所有通道，外设到内存、内存到外设、内存到内存传输
 */

/* Include config.h first to get module enable flags */
#include "config.h"

#if CONFIG_MODULE_DMA_ENABLED

/* Include our header */
#include "dma.h"

#include "delay.h"
#include "nvic.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

/* 从board.h加载配置 */
static DMA_Config_t g_dma_configs[DMA_CHANNEL_MAX] = DMA_CONFIGS;

/* 初始化标志 */
static bool g_dma_initialized[DMA_CHANNEL_MAX] = {false};

/* 传输完成回调函数 */
static DMA_TransferCompleteCallback_t g_dma_callbacks[DMA_CHANNEL_MAX] = {NULL};
static void *g_dma_user_data[DMA_CHANNEL_MAX] = {NULL};

/* 中断回调函数数组（支持3种中断类型：TC、HT、TE） */
static DMA_IT_Callback_t g_dma_it_callbacks[DMA_CHANNEL_MAX][3] = {NULL};
static void *g_dma_it_user_data[DMA_CHANNEL_MAX][3] = {NULL};

/* 默认超时时间（毫秒） */
#define DMA_DEFAULT_TIMEOUT_MS  5000

/**
 * @brief 获取DMA通道外设指针
 * @param[in] channel DMA通道索引
 * @return DMA_Channel_TypeDef* DMA通道指针，失败返回NULL
 */
static DMA_Channel_TypeDef* DMA_GetChannelPeriph(DMA_Channel_t channel)
{
    (void)channel;
    return NULL;
}

/**
 * @brief 获取DMA外设时钟
 * @param[in] channel DMA通道索引
 * @return uint32_t 时钟使能值，失败返回0
 */
static uint32_t DMA_GetPeriphClock(DMA_Channel_t channel)
{
    (void)channel;
    return 0;
}

/**
 * @brief DMA初始化
 */
DMA_Status_t DMA_HW_Init(DMA_Channel_t channel)
{
    return DMA_OK;
}

/**
 * @brief DMA反初始化
 */
DMA_Status_t DMA_Deinit(DMA_Channel_t channel)
{
    return DMA_OK;
}

/**
 * @brief 配置DMA传输（外设到内存或内存到外设）
 */
DMA_Status_t DMA_ConfigTransfer(DMA_Channel_t channel, uint32_t peripheral_addr,
                                uint32_t memory_addr, uint16_t data_size,
                                DMA_Direction_t direction, uint8_t data_width)
{
    return DMA_OK;
}

/**
 * @brief 配置DMA内存到内存传输
 */
DMA_Status_t DMA_ConfigMemoryToMemory(DMA_Channel_t channel, uint32_t src_addr,
                                      uint32_t dst_addr, uint16_t data_size, uint8_t data_width)
{
    return DMA_OK;
}

/**
 * @brief 启动DMA传输
 */
DMA_Status_t DMA_Start(DMA_Channel_t channel)
{
    return DMA_OK;
}

/**
 * @brief 停止DMA传输
 */
DMA_Status_t DMA_Stop(DMA_Channel_t channel)
{
    return DMA_OK;
}

/**
 * @brief 等待DMA传输完成（阻塞式）
 */
DMA_Status_t DMA_WaitComplete(DMA_Channel_t channel, uint32_t timeout)
{
    return DMA_OK;
}

/**
 * @brief 检查DMA传输是否完成
 */
uint8_t DMA_IsComplete(DMA_Channel_t channel)
{
    return 0;
}

/**
 * @brief 获取剩余传输数据量
 */
uint16_t DMA_GetRemainingDataSize(DMA_Channel_t channel)
{
    return 0;
}

/**
 * @brief 设置DMA传输完成回调函数
 */
DMA_Status_t DMA_SetTransferCompleteCallback(DMA_Channel_t channel,
                                             DMA_TransferCompleteCallback_t callback,
                                             void *user_data)
{
    return DMA_OK;
}

/**
 * @brief 检查DMA是否已初始化
 */
uint8_t DMA_IsInitialized(DMA_Channel_t channel)
{
    return 0;
}

/**
 * @brief 获取DMA通道外设指针
 */
DMA_Channel_TypeDef* DMA_GetChannel(DMA_Channel_t channel)
{
    return NULL;
}

/**
 * @brief 设置DMA传输模式（正常/循环）
 */
DMA_Status_t DMA_SetMode(DMA_Channel_t channel, uint8_t mode)
{
    return DMA_OK;
}

/* ========== 中断模式功能实现 ========== */

/**
 * @brief 获取DMA中断类型对应的SPL库中断值
 */
static uint32_t DMA_GetITValue(DMA_IT_t it_type)
{
    (void)it_type;
    return 0;
}

/**
 * @brief 获取DMA通道对应的IRQn
 */
static IRQn_Type DMA_GetIRQn(DMA_Channel_t channel)
{
    (void)channel;
    return (IRQn_Type)0;
}

/**
 * @brief 使能DMA中断
 */
DMA_Status_t DMA_EnableIT(DMA_Channel_t channel, DMA_IT_t it_type)
{
    return DMA_OK;
}

/**
 * @brief 禁用DMA中断
 */
DMA_Status_t DMA_DisableIT(DMA_Channel_t channel, DMA_IT_t it_type)
{
    return DMA_OK;
}

/**
 * @brief 设置DMA中断回调函数
 */
DMA_Status_t DMA_SetITCallback(DMA_Channel_t channel, DMA_IT_t it_type,
                                DMA_IT_Callback_t callback, void *user_data)
{
    return DMA_OK;
}

/**
 * @brief DMA中断服务函数
 */
void DMA_IRQHandler(DMA_Channel_t channel)
{
}

/* DMA中断服务程序入口 */
void DMA1_Channel1_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_1); }
void DMA1_Channel2_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_2); }
void DMA1_Channel3_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_3); }
void DMA1_Channel4_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_4); }
void DMA1_Channel5_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_5); }
void DMA1_Channel6_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_6); }
void DMA1_Channel7_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_7); }

#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
void DMA2_Channel1_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_1); }
void DMA2_Channel2_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_2); }
void DMA2_Channel3_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_3); }
void DMA2_Channel4_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_4); }
void DMA2_Channel5_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_5); }
#endif

#endif /* CONFIG_MODULE_DMA_ENABLED */

